Tekla Open API Reference for Tekla Structures 2025
Double.Value Property
 The value of the double datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Value { get; set; }
Public Property Value As Double
	Get
	Set
Property Value
Type: Double
Implements
IDoubleDataType.Value
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace